
exports.DashboardType = {
    Map: 1,
    Scatter: 2,
    Line: 3
};


/*
* 지도 좌표 변환
* ex [126.98955, 37.5651]
* */
exports.LngLat = [
    //서울
    {
        text: '서울 서초구',
        lnglat: [127.004904, 37.505144]//고속터미널
    },
    {
        text: '서울 강남구',
        lnglat: [127.036957, 37.501040]//역삼역
    },
    {
        text: '서울 종로구',
        lnglat: [126.976436, 37.571874] //광화문역
    },
    {
        text: '서울 송파구',
        lnglat: [127.100134, 37.513457] //잠실역
    },
    {
        text: '서울 동작구',
        lnglat: [126.947710, 37.503336] //상도역
    },
    {
        text: '서울 중구',
        lnglat: [126.993529, 37.561169] //충무로역 37.530196, 126.964807
    },
    {
        text: '서울 용산구',
        lnglat: [126.964807, 37.530196] //용산역
    },
    {
        text: '서울 관악구',
        lnglat: [126.951916, 37.460086] //서울대학교
    },
    {
        text: '서울 양천구',
        lnglat: [126.864290, 37.526293] //목동역
    },
    {
        text: '서울 마포구',
        lnglat: [126.952134, 37.542908] //공덕역
    },
    {
        text: '서울 동대문구',
        lnglat: [127.057872, 37.590066] //회기역
    },
    {
        text: '서울 성동구',
        lnglat: [127.043687, 37.555840] //한양대역
    },
    {
        text: '서울 강동구',
        lnglat: [127.123762, 37.5301251]
    },
    {
        text: '서울 강북구',
        lnglat: [127.0256575, 37.6396099] 
    },
    {
        text: '서울 강서구',
        lnglat: [126.8495382, 37.5509786]
    },
    {
        text: '서울 광진구',
        lnglat: [127.0822938, 37.5384843]
    },
    {
        text: '서울 구로구',
        lnglat: [126.887369, 37.4954031]
    },
    {
        text: '서울 금천구',
        lnglat: [126.9020358, 37.4518527]
    },
    {
        text: '서울 노원구',
        lnglat: [127.056793, 37.6541917]
    },
    {
        text: '서울 도봉구',
        lnglat: [127.0470706, 37.6687738]
    },
    {
        text: '서울 서대문구',
        lnglat: [126.9367789, 37.5791158]
    },
    {
        text: '서울 서초구',
        lnglat: [127.0324112, 37.4837121]
    },
    {
        text: '서울 성북구',
        lnglat: [127.0182146, 37.589116]
    },
    {
        text: '서울 송파구',
        lnglat: [127.1065971, 37.5145437]
    },
    {
        text: '서울 영등포구',
        lnglat: [126.8962283, 37.5263715]
    },
    {
        text: '서울 용산구',
        lnglat: [126.9654442, 37.5384272]
    },
    {
        text: '서울 은평구',
        lnglat: [126.9291119, 37.6026957]
    },
    {
        text: '서울 종로구',
        lnglat: [126.9793579, 37.5729503]
    },
    {
        text: '서울 중구',
        lnglat: [127.1065971, 37.5640907]
    },
    {
        text: '서울 중랑구',
        lnglat: [127.0926519, 37.6065602]
    },
    {
        text: '서울시 서초구',
        lnglat: [127.004904, 37.505144]//고속터미널
    },
    {
        text: '서울시 강남구',
        lnglat: [127.036957, 37.501040]//역삼역
    },
    {
        text: '서울시 종로구',
        lnglat: [126.976436, 37.571874] //광화문역
    },
    {
        text: '서울시 송파구',
        lnglat: [127.100134, 37.513457] //잠실역
    },
    {
        text: '서울시 동작구',
        lnglat: [126.947710, 37.503336] //상도역
    },
    {
        text: '서울시 중구',
        lnglat: [126.993529, 37.561169] //충무로역 37.530196, 126.964807
    },
    {
        text: '서울시 용산구',
        lnglat: [126.964807, 37.530196] //용산역
    },
    {
        text: '서울시 관악구',
        lnglat: [126.951916, 37.460086] //서울대학교
    },
    {
        text: '서울시 양천구',
        lnglat: [126.864290, 37.526293] //목동역
    },
    {
        text: '서울시 마포구',
        lnglat: [126.952134, 37.542908] //공덕역
    },
    {
        text: '서울시 동대문구',
        lnglat: [127.057872, 37.590066] //회기역
    },
    {
        text: '서울시 성동구',
        lnglat: [127.043687, 37.555840] //한양대역
    },
    {
        text: '서울시 강동구',
        lnglat: [127.123762, 37.5301251]
    },
    {
        text: '서울시 강북구',
        lnglat: [127.0256575, 37.6396099] 
    },
    {
        text: '서울시 강서구',
        lnglat: [126.8495382, 37.5509786]
    },
    {
        text: '서울시 광진구',
        lnglat: [127.0822938, 37.5384843]
    },
    {
        text: '서울시 구로구',
        lnglat: [126.887369, 37.4954031]
    },
    {
        text: '서울시 금천구',
        lnglat: [126.9020358, 37.4518527]
    },
    {
        text: '서울시 노원구',
        lnglat: [127.056793, 37.6541917]
    },
    {
        text: '서울시 도봉구',
        lnglat: [127.0470706, 37.6687738]
    },
    {
        text: '서울시 서대문구',
        lnglat: [126.9367789, 37.5791158]
    },
    {
        text: '서울시 서초구',
        lnglat: [127.0324112, 37.4837121]
    },
    {
        text: '서울시 성북구',
        lnglat: [127.0182146, 37.589116]
    },
    {
        text: '서울시 송파구',
        lnglat: [127.1065971, 37.5145437]
    },
    {
        text: '서울시 영등포구',
        lnglat: [126.8962283, 37.5263715]
    },
    {
        text: '서울시 용산구',
        lnglat: [126.9654442, 37.5384272]
    },
    {
        text: '서울시 은평구',
        lnglat: [126.9291119, 37.6026957]
    },
    {
        text: '서울시 종로구',
        lnglat: [126.9793579, 37.5729503]
    },
    {
        text: '서울시 중구',
        lnglat: [127.1065971, 37.5640907]
    },
    {
        text: '서울시 중랑구',
        lnglat: [127.0926519, 37.6065602]
    },
    
    //경기
    {
        text: '경기 수원시',
        lnglat: [127.0286009, 37.2635727]
    },
    {
        text: '경기 하남시',
        lnglat: [127.2148919, 37.5392646]
    },
    {
        text: '경기 고양시',
        lnglat: [126.8320201, 37.65835990000001]
    },
    {
        text: '경기 이천시',
        lnglat: [127.4348221, 37.2719952]
    },
    {
        text: '경기 성남시',
        lnglat: [127.1388684, 37.4449168]
    },
    {
        text: '경기 광명시',
        lnglat: [126.8642888, 37.4784878]
    },
    {
        text: '경기 용인시',
        lnglat: [127.1775537, 37.2410864]
    },
    {
        text: '경기 의왕시',
        lnglat: [126.9683104, 37.344701]
    },
    {
        text: '경기 안양시',
        lnglat: [126.9568209, 37.3942527]
    },
    {
        text: '경기 평택시',
        lnglat: [127.1129451, 36.9921075]
    },
    {
        text: '경기 부천시',
        lnglat: [126.7660309, 37.5034138]
    },
    {
        text: '경기 의정부시',
        lnglat: [127.0336819, 37.73809800000001]
    },
    {
        text: '경기 광주시',
        lnglat: [127.2561413, 37.4171413]
    },
    {
        text: '경기 여주시',
        lnglat: [127.6371628, 37.2980237]
    },
    {
        text: '경기 가평군',
        lnglat: [127.5098827, 37.8315403]
    },
    {
        text: '경기 양주시',
        lnglat: [127.0458453, 37.7852875]
    },
    {
        text: '경기 군포시',
        lnglat: [126.9351741, 37.3616703]
    },
    {
        text: '경기 동두천시',
        lnglat: [127.0605075, 37.9034112]
    },
    {
        text: '경기 화성시',
        lnglat: [126.8311887, 37.1994932]
    },
    {
        text: '경기 안산시',
        lnglat: [126.8308848, 37.3218778]
    },
    {
        text: '경기 남양주시',
        lnglat: [127.2165279, 37.6360028]
    },
    {
        text: '경기 과천시',
        lnglat: [126.9874451, 37.429246]
    },
    {
        text: '경기 시흥시',
        lnglat: [126.8031025, 37.3798877]
    },
    {
        text: '경기 연천군',
        lnglat: [127.0748335, 38.0964438]
    },
    {
        text: '경기 오산시',
        lnglat: [127.0772212, 37.1498096]
    },
    {
        text: '경기 김포시',
        lnglat: [126.7156325, 37.6152464]
    },
    {
        text: '경기 안성시',
        lnglat: [127.2796786, 37.0079695]
    },
    {
        text: '경기 구리시',
        lnglat: [127.1295646, 37.5943124]
    },
    {
        text: '경기 양평군',
        lnglat: [127.4875607, 37.4912195]
    },
    {
        text: '경기 포천시',
        lnglat: [127.2003551, 37.8949148]
    },
    {
        text: '경기 파주시',
        lnglat: [126.7801781, 37.7598688]
    },

    
    

    //부산
    {
        text: '부산 중구',
        lnglat: [129.0323417, 35.1061462]
    },
    {
        text: '부산 금정구',
        lnglat: [129.0922773, 35.2429921]
    },
    {
        text: '부산 북구',
        lnglat: [128.9903711, 35.1971347]
    },
    {
        text: '부산 연제구',
        lnglat: [129.0797244, 35.1761938]
    },
    {
        text: '부산 사상구',
        lnglat: [128.9908173, 35.1526399]
    },
    {
        text: '부산 영도구',
        lnglat: [129.0681448, 35.0912316]
    },
    {
        text: '부산 기장군',
        lnglat: [129.2221542, 35.2445494]
    },
    {
        text: '부산 남구',
        lnglat: [129.084364, 35.1365596]
    },
    {
        text: '부산 사하구',
        lnglat: [128.9747081, 35.1044223]
    },
    {
        text: '부산 부산진구',
        lnglat: [129.0531722, 35.1630009]
    },
    {
        text: '부산 동구',
        lnglat: [129.0569225, 35.1390588]
    },
    {
        text: '부산 서구',
        lnglat: [129.0241207, 35.09773]
    },
    {
        text: '부산 해운대구',
        lnglat: [129.1635509, 35.1631139]
    },
    {
        text: '부산 강서구',
        lnglat: [128.9805666, 35.2122157]
    },
    {
        text: '부산 수영구',
        lnglat: [129.1130831, 35.145615]
    },
    {
        text: '부산 동래구',
        lnglat: [129.0836402, 35.2048575]
    },


    // 전남
    {
        text: '전남 강진군',
        lnglat: [126.767261, 34.6420774]
    },
    {
        text: '전남 완도군',
        lnglat: [126.7550541, 34.3110596]
    },
    {
        text: '전남 순천시',
        lnglat: [127.4872135, 34.950637]
    },
    {
        text: '전남 신안군',
        lnglat: [126.101074, 34.827332]
    },
    {
        text: '전남 진도군',
        lnglat: [126.2634853, 34.4868712]
    },
    {
        text: '전남 목포시',
        lnglat: [126.3921664, 34.8118351]
    },
    {
        text: '전남 나주시',
        lnglat: [126.7107572, 35.0160601]
    },
    {
        text: '전남 곡성군',
        lnglat: [127.2919175, 35.2819553]
    },
    {
        text: '전남 화순군',
        lnglat: [126.9864799, 35.0645029]
    },
    {
        text: '전남 장성군',
        lnglat: [126.7848541, 35.3018333]
    },
    {
        text: '전남 함평군',
        lnglat: [126.5165524, 35.0659399]
    },
    {
        text: '전남 영암군',
        lnglat: [126.6967918, 34.8001685]
    },
    {
        text: '전남 보성군',
        lnglat: [127.0798944, 34.7714563]
    },
    {
        text: '전남 해남군',
        lnglat: [126.5989274, 34.5732516]
    },
    {
        text: '전남 무안군',
        lnglat: [126.4816856, 34.99045419999999]
    },
    {
        text: '전남 고흥군',
        lnglat: [127.284978, 34.6112219]
    },
    {
        text: '전남 여수시',
        lnglat: [127.6622221, 34.7603737]
    },
    {
        text: '전남 구례군',
        lnglat: [127.4626534, 35.2024947]
    },
    {
        text: '전남 광양시',
        lnglat: [127.6958882, 34.9406968]
    },
    {
        text: '전남 영광군',
        lnglat: [126.5119874, 35.2771719]
    },
    {
        text: '전남 장흥군',
        lnglat: [126.9069278, 34.6816856]
    },
    {
        text: '전남 담양군',
        lnglat: [126.9881673, 35.3211394]
    },

    // 전북
    {
        text: '전북 김제시',
        lnglat: [126.8808872, 35.8036079]
    },
    {
        text: '전북 장수군',
        lnglat: [127.5211363, 35.6472767]
    },
    {
        text: '전북 임실군',
        lnglat: [127.2826599, 35.6110549]
    },
    {
        text: '전북 익산시',
        lnglat: [126.9575991, 35.9482858]
    },
    {
        text: '전북 부안군',
        lnglat: [126.7334651, 35.73156609999999]
    },
    {
        text: '전북 순창군',
        lnglat: [127.1375968, 35.3744136]
    },
    {
        text: '전북 고창군',
        lnglat: [126.7020806, 35.4358216]
    },
    {
        text: '전북 군산시',
        lnglat: [126.7366293, 35.9676772]
    },
    {
        text: '전북 완주군',
        lnglat: [127.253895, 35.891275]
    },
    {
        text: '전북 남원시',
        lnglat: [127.3904877, 35.416357]
    },
    {
        text: '전북 정읍시',
        lnglat: [126.8558955, 35.5698855]
    },
    {
        text: '전북 진안군',
        lnglat: [127.4248356, 35.7917297]
    },
    {
        text: '전북 무주군',
        lnglat: [127.6607805, 36.0068191]
    },
    {
        text: '전북 전주시',
        lnglat: [127.1479532, 35.8242238]
    },

    // 충남
    {
        text: '충남 금산군',
        lnglat: [127.4880712, 36.1086928]
    },
    {
        text: '충남 논산시',
        lnglat: [127.0987453, 36.1870656]
    },
    {
        text: '충남 보령시',
        lnglat: [126.6129441, 36.3331629]
    },
    {
        text: '충남 예산군',
        lnglat: [126.8483951, 36.6826123]
    },
    {
        text: '충남 홍성군',
        lnglat: [126.6607764, 36.60123]
    },
    {
        text: '충남 청양군',
        lnglat: [126.8022116, 36.4588326]
    },
    {
        text: '충남 아산시',
        lnglat: [127.0018494, 36.789796]
    },
    {
        text: '충남 부여군',
        lnglat: [126.910178, 36.2754406]
    },
    {
        text: '충남 서산시',
        lnglat: [126.4503169, 36.7844993]
    },
    {
        text: '충남 당진시',
        lnglat: [126.6283278, 36.8936109]
    },
    {
        text: '충남 천안시',
        lnglat: [127.1138939, 36.815129]
    },
    {
        text: '충남 공주시',
        lnglat: [127.1191534, 36.4465346]
    },
    {
        text: '충남 태안군',
        lnglat: [126.2980528, 36.7456421]
    },
    {
        text: '충남 서천군',
        lnglat: [126.6913277, 36.0803312]
    },
    {
        text: '충남 계룡시',
        lnglat: [127.2485896, 36.2745577]
    },

    // 충북
    {
        text: '충북 진천군',
        lnglat: [127.4361117, 36.8553798]
    },
    {
        text: '충북 청주시',
        lnglat: [127.4890319, 36.6424341]
    },
    {
        text: '충북 증평군',
        lnglat: [127.5816556, 36.7855019]
    },
    {
        text: '충북 음성군',
        lnglat: [127.6905018, 36.9396792]
    },
    {
        text: '충북 제천시',
        lnglat: [128.1909481, 37.1325821]
    },
    {
        text: '충북 충주시',
        lnglat: [127.9259497, 36.9910113]
    },
    {
        text: '충북 옥천군',
        lnglat: [127.5712809, 36.30636459999999]
    },
    {
        text: '충북 괴산군',
        lnglat: [127.7865791, 36.815669]
    },
    {
        text: '충북 보은군',
        lnglat: [127.7294827, 36.4894573]
    },
    {
        text: '충북 단양군',
        lnglat: [128.3655186, 36.9845473]
    },
    {
        text: '충북 영동군',
        lnglat: [127.7834302, 36.1750231]
    },

    // 광주
    {
        text: '광주 동구',
        lnglat: [126.9231228, 35.1461042]
    },
    {
        text: '광주 북구',
        lnglat: [126.9119842, 35.1740167]
    },
    {
        text: '광주 남구',
        lnglat: [126.9079579, 35.1221068]
    },
    {
        text: '광주 서구',
        lnglat: [126.8910977, 35.1528248]
    },
    {
        text: '광주 광산구',
        lnglat: [126.7937183, 35.1394638]
    },

    // 대전
    {
        text: '대전 동구',
        lnglat: [127.4326826, 36.3269986]
    },
    {
        text: '대전 유성구',
        lnglat: [127.3561329, 36.362216]
    },
    {
        text: '대전 중구',
        lnglat: [127.4212387, 36.3253046]
    },
    {
        text: '대전 서구',
        lnglat: [127.3836025, 36.3545224]
    },
    {
        text: '대전 대덕구',
        lnglat: [127.4155717, 36.3467189]
    },

    // 세종시
    {
        text: '세종시',
        lnglat: [127.0371025, 37.5633415]
    },

    // 강원도
    {
        text: '강원 인제군',
        lnglat: [128.1706991, 38.0694675]
    },
    {
        text: '강원 양양군',
        lnglat: [128.6188503, 38.0753925]
    },
    {
        text: '강원 동해시',
        lnglat: [129.1142915, 37.5247192]
    },
    {
        text: '강원 평창군',
        lnglat: [128.3899769, 37.370474]
    },
    {
        text: '강원 영월군',
        lnglat: [128.4617535, 37.183637]
    },
    {
        text: '강원 원주시',
        lnglat: [127.9201621, 37.3422186]
    },
    {
        text: '강원 속초시',
        lnglat: [128.5918488, 38.2070148]
    },
    {
        text: '강원 삼척시',
        lnglat: [129.1652059, 37.4498683]
    },
    {
        text: '강원 양구군',
        lnglat: [127.9898825, 38.1100701]
    },
    {
        text: '강원 철원군',
        lnglat: [127.3132256, 38.146609]
    },
    {
        text: '강원 태백시',
        lnglat: [128.9855649, 37.1640654]
    },
    {
        text: '강원 횡성군',
        lnglat: [127.9849295, 37.4917566]
    },
    {
        text: '강원 춘천시',
        lnglat: [127.7299707, 37.8813153]
    },
    {
        text: '강원 강릉시',
        lnglat: [128.8760574, 37.751853]
    },
    {
        text: '강원 홍천군',
        lnglat: [127.8886827, 37.6969518]
    },
    {
        text: '강원 정선군',
        lnglat: [128.6609505, 37.3807549]
    },
    {
        text: '강원 화천군',
        lnglat: [127.7080492, 38.1056484]
    },
    {
        text: '강원 고성군',
        lnglat: [128.4674385, 38.3801292]
    },

    // 경북
    {
        text: '경북 성주군',
        lnglat: [128.2829738, 35.9190079]
    },
    {
        text: '경북 군위군',
        lnglat: [128.5727702, 36.2428355]
    },
    {
        text: '경북 경주시',
        lnglat: [129.2247477, 35.8561719]
    },
    {
        text: '경북 포항시',
        lnglat: [129.3434808, 36.0190178]
    },
    {
        text: '경북 고령군',
        lnglat: [128.262953, 35.7261415]
    },
    {
        text: '경북 영덕군',
        lnglat: [129.3659681, 36.41507989999999]
    },
    {
        text: '경북 예천군',
        lnglat: [128.4528808, 36.6577004]
    },
    {
        text: '경북 청송군',
        lnglat: [129.0571077, 36.4359045]
    },
    {
        text: '경북 의성군',
        lnglat: [128.6970053, 36.3526576]
    },
    {
        text: '경북 영주시',
        lnglat: [128.6240551, 36.8056858]
    },
    {
        text: '경북 영천시',
        lnglat: [128.9385493, 35.97329149999999]
    },
    {
        text: '경북 울진군',
        lnglat: [129.4004195, 36.9930661]
    },
    {
        text: '경북 칠곡군',
        lnglat: [128.4015434, 35.9953059]
    },
    {
        text: '경북 경산시',
        lnglat: [128.7415441, 35.8250555]
    },
    {
        text: '경북 안동시',
        lnglat: [128.729357, 36.5683543]
    },
    {
        text: '경북 울릉군',
        lnglat: [130.9058002, 37.4844171]
    },
    {
        text: '경북 문경시',
        lnglat: [128.1867972, 36.586148]
    },
    {
        text: '경북 영양군',
        lnglat: [129.1124007, 36.6666558]
    },
    {
        text: '경북 청도군',
        lnglat: [128.7339107, 35.6472706]
    },
    {
        text: '경북 구미시',
        lnglat: [128.3445734, 36.119485]
    },
    {
        text: '경북 봉화군',
        lnglat: [128.7323752, 36.8930933]
    },
    {
        text: '경북 상주시',
        lnglat: [128.1590828, 36.4109466]
    },
    {
        text: '경북 김천시',
        lnglat: [128.1135947, 36.1398393]
    },

    //경남
    {
        text: '경남 양산시',
        lnglat: [129.0371689, 35.3350072]
    },
    {
        text: '경남 통영시',
        lnglat: [128.433182, 34.8544227]
    },
    {
        text: '경남 밀양시',
        lnglat: [128.7464415, 35.5037598]
    },
    {
        text: '경남 함안군',
        lnglat: [128.4064797, 35.2725591]
    },
    {
        text: '경남 사천시',
        lnglat: [128.064185, 35.0037788]
    },
    {
        text: '경남 창녕군',
        lnglat: [128.4922143, 35.5445563]
    },
    {
        text: '경남 김해시',
        lnglat: [128.8893517, 35.2285451]
    },
    {
        text: '경남 고성군',
        lnglat: [128.3222456, 34.973149]
    },
    {
        text: '경남 함양군',
        lnglat: [127.7251763, 35.52046139999999]
    },
    {
        text: '경남 창원시',
        lnglat: [128.6044476, 35.2518842]
    },
    {
        text: '경남 의령군',
        lnglat: [128.261658, 35.3221896]
    },
    {
        text: '경남 거제시',
        lnglat: [128.6210824, 34.8806427]
    },
    {
        text: '경남 거창군',
        lnglat: [127.9095155, 35.6867229]
    },
    {
        text: '경남 산청군',
        lnglat: [127.8734981, 35.4155885]
    },
    {
        text: '경남 합천군',
        lnglat: [128.1657995, 35.5665758]
    },
    {
        text: '경남 진주시',
        lnglat: [128.1076213, 35.1799817]
    },
    {
        text: '경남 남해군',
        lnglat: [127.8924234, 34.8376721]
    },
    {
        text: '경남 하동군',
        lnglat: [127.7512687, 35.0672108]
    },

    // 대구
    {
        text: '대구 남구',
        lnglat: [128.5975291, 35.8460224]
    },
    {
        text: '대구 중구',
        lnglat: [128.6061666, 35.8693527]
    },
    {
        text: '대구 북구',
        lnglat: [128.5828073, 35.8857114]
    },
    {
        text: '대구 달서구',
        lnglat: [128.5327576, 35.8298561]
    },
    {
        text: '대구 동구',
        lnglat: [128.6353024, 35.8866012]
    },
    {
        text: '대구 달성군',
        lnglat: [128.4317137, 35.7746388]
    },
    {
        text: '대구 서구',
        lnglat: [128.559115, 35.8717686]
    },
    {
        text: '대구 수성구',
        lnglat: [128.6306086, 35.8582435]
    },

    // 울산
    {
        text: '울산 남구',
        lnglat: [129.3298017, 35.54368300000001]
    },
    {
        text: '울산 울주군',
        lnglat: [129.2, 35.54]
    },
    {
        text: '울산 동구',
        lnglat: [129.4166007, 35.5048563]
    },
    {
        text: '울산 북구',
        lnglat: [129.3609087, 35.58273399999999]
    },
    {
        text: '울산 중구',
        lnglat: [129.3321348, 35.56879110000001]
    },

    // 제주
    {
        text: '제주 서귀포시',
        lnglat: [126.560076, 33.2541205]
    },
    {
        text: '제주 제주시',
        lnglat: [126.5311884, 33.4996213]
    }

];

