
exports.DashboardType = {
    Map: 1,
    Scatter: 2,
    Line: 3
};


/*
* 지도 좌표 변환
* ex [126.98955, 37.5651]
* */
exports.LngLat = [
    //서울
    {
        text: '서울 서초구',
        lnglat: [127.004904, 37.505144]//고속터미널
    },
    {
        text: '서울 강남구',
        lnglat: [127.036957, 37.501040]//역삼역
    },
    {
        text: '서울 종로구',
        lnglat: [126.976436, 37.571874] //광화문역
    },
    {
        text: '서울 송파구',
        lnglat: [127.100134, 37.513457] //잠실역
    },
    {
        text: '서울 동작구',
        lnglat: [126.947710, 37.503336] //상도역
    },
    {
        text: '서울 중구',
        lnglat: [126.993529, 37.561169] //충무로역 37.530196, 126.964807
    },
    {
        text: '서울 용산구',
        lnglat: [126.964807, 37.530196] //용산역
    },
    {
        text: '서울 관악구',
        lnglat: [126.951916, 37.460086] //서울대학교
    },
    {
        text: '서울 양천구',
        lnglat: [126.864290, 37.526293] //목동역
    },
    {
        text: '서울 마포구',
        lnglat: [126.952134, 37.542908] //공덕역
    },
    {
        text: '서울 동대문구',
        lnglat: [127.057872, 37.590066] //회기역
    },
    {
        text: '서울 성동구',
        lnglat: [127.043687, 37.555840] //한양대역
    },
    {
        text: '서울 강동구',
        lnglat: [127.123762, 37.5301251]
    },
    {
        text: '서울 강북구',
        lnglat: [127.0256575, 37.6396099] 
    },
    {
        text: '서울 강서구',
        lnglat: [126.8495382, 37.5509786]
    },
    {
        text: '서울 광진구',
        lnglat: [127.0822938, 37.5384843]
    },
    {
        text: '서울 구로구',
        lnglat: [126.887369, 37.4954031]
    },
    {
        text: '서울 금천구',
        lnglat: [126.9020358, 37.4518527]
    },
    {
        text: '서울 노원구',
        lnglat: [127.056793, 37.6541917]
    },
    {
        text: '서울 도봉구',
        lnglat: [127.0470706, 37.6687738]
    },
    {
        text: '서울 서대문구',
        lnglat: [126.9367789, 37.5791158]
    },
    {
        text: '서울 서초구',
        lnglat: [127.0324112, 37.4837121]
    },
    {
        text: '서울 성북구',
        lnglat: [127.0182146, 37.589116]
    },
    {
        text: '서울 송파구',
        lnglat: [127.1065971, 37.5145437]
    },
    {
        text: '서울 영등포구',
        lnglat: [126.8962283, 37.5263715]
    },
    {
        text: '서울 용산구',
        lnglat: [126.9654442, 37.5384272]
    },
    {
        text: '서울 은평구',
        lnglat: [126.9291119, 37.6026957]
    },
    {
        text: '서울 종로구',
        lnglat: [126.9793579, 37.5729503]
    },
    {
        text: '서울 중구',
        lnglat: [127.1065971, 37.5640907]
    },
    {
        text: '서울 중랑구',
        lnglat: [127.0926519, 37.6065602]
    },
    {
        text: '서울시 서초구',
        lnglat: [127.004904, 37.505144]//고속터미널
    },
    {
        text: '서울시 강남구',
        lnglat: [127.036957, 37.501040]//역삼역
    },
    {
        text: '서울시 종로구',
        lnglat: [126.976436, 37.571874] //광화문역
    },
    {
        text: '서울시 송파구',
        lnglat: [127.100134, 37.513457] //잠실역
    },
    {
        text: '서울시 동작구',
        lnglat: [126.947710, 37.503336] //상도역
    },
    {
        text: '서울시 중구',
        lnglat: [126.993529, 37.561169] //충무로역 37.530196, 126.964807
    },
    {
        text: '서울시 용산구',
        lnglat: [126.964807, 37.530196] //용산역
    },
    {
        text: '서울시 관악구',
        lnglat: [126.951916, 37.460086] //서울대학교
    },
    {
        text: '서울시 양천구',
        lnglat: [126.864290, 37.526293] //목동역
    },
    {
        text: '서울시 마포구',
        lnglat: [126.952134, 37.542908] //공덕역
    },
    {
        text: '서울시 동대문구',
        lnglat: [127.057872, 37.590066] //회기역
    },
    {
        text: '서울시 성동구',
        lnglat: [127.043687, 37.555840] //한양대역
    },
    {
        text: '서울시 강동구',
        lnglat: [127.123762, 37.5301251]
    },
    {
        text: '서울시 강북구',
        lnglat: [127.0256575, 37.6396099] 
    },
    {
        text: '서울시 강서구',
        lnglat: [126.8495382, 37.5509786]
    },
    {
        text: '서울시 광진구',
        lnglat: [127.0822938, 37.5384843]
    },
    {
        text: '서울시 구로구',
        lnglat: [126.887369, 37.4954031]
    },
    {
        text: '서울시 금천구',
        lnglat: [126.9020358, 37.4518527]
    },
    {
        text: '서울시 노원구',
        lnglat: [127.056793, 37.6541917]
    },
    {
        text: '서울시 도봉구',
        lnglat: [127.0470706, 37.6687738]
    },
    {
        text: '서울시 서대문구',
        lnglat: [126.9367789, 37.5791158]
    },
    {
        text: '서울시 서초구',
        lnglat: [127.0324112, 37.4837121]
    },
    {
        text: '서울시 성북구',
        lnglat: [127.0182146, 37.589116]
    },
    {
        text: '서울시 송파구',
        lnglat: [127.1065971, 37.5145437]
    },
    {
        text: '서울시 영등포구',
        lnglat: [126.8962283, 37.5263715]
    },
    {
        text: '서울시 용산구',
        lnglat: [126.9654442, 37.5384272]
    },
    {
        text: '서울시 은평구',
        lnglat: [126.9291119, 37.6026957]
    },
    {
        text: '서울시 종로구',
        lnglat: [126.9793579, 37.5729503]
    },
    {
        text: '서울시 중구',
        lnglat: [127.1065971, 37.5640907]
    },
    {
        text: '서울시 중랑구',
        lnglat: [127.0926519, 37.6065602]
    },
    
    //경기
    {
        text: '경기 수원시',
        lnglat: [127.0286009, 37.2635727]
    },
    {
        text: '경기 하남시',
        lnglat: [127.2148919, 37.5392646]
    },
    {
        text: '경기 고양시',
        lnglat: [126.8320201, 37.65835990000001]
    },
    {
        text: '경기 이천시',
        lnglat: [127.4348221, 37.2719952]
    },
    {
        text: '경기 성남시',
        lnglat: [127.1388684, 37.4449168]
    },
    {
        text: '경기 광명시',
        lnglat: [126.8642888, 37.4784878]
    },
    {
        text: '경기 용인시',
        lnglat: [127.1775537, 37.2410864]
    },
    {
        text: '경기 의왕시',
        lnglat: [126.9683104, 37.344701]
    },
    {
        text: '경기 안양시',
        lnglat: [126.9568209, 37.3942527]
    },
    {
        text: '경기 평택시',
        lnglat: [127.1129451, 36.9921075]
    },
    {
        text: '경기 부천시',
        lnglat: [126.7660309, 37.5034138]
    },
    {
        text: '경기 의정부시',
        lnglat: [127.0336819, 37.73809800000001]
    },
    {
        text: '경기 광주시',
        lnglat: [127.2561413, 37.4171413]
    },
    {
        text: '경기 여주시',
        lnglat: [127.6371628, 37.2980237]
    },
    {
        text: '경기 가평군',
        lnglat: [127.5098827, 37.8315403]
    },
    {
        text: '경기 양주시',
        lnglat: [127.0458453, 37.7852875]
    },
    {
        text: '경기 군포시',
        lnglat: [126.9351741, 37.3616703]
    },
    {
        text: '경기 동두천시',
        lnglat: [127.0605075, 37.9034112]
    },
    {
        text: '경기 화성시',
        lnglat: [126.8311887, 37.1994932]
    },
    {
        text: '경기 안산시',
        lnglat: [126.8308848, 37.3218778]
    },
    {
        text: '경기 남양주시',
        lnglat: [127.2165279, 37.6360028]
    },
    {
        text: '경기 과천시',
        lnglat: [126.9874451, 37.429246]
    },
    {
        text: '경기 시흥시',
        lnglat: [126.8031025, 37.3798877]
    },
    {
        text: '경기 연천군',
        lnglat: [127.0748335, 38.0964438]
    },
    {
        text: '경기 오산시',
        lnglat: [127.0772212, 37.1498096]
    },
    {
        text: '경기 김포시',
        lnglat: [126.7156325, 37.6152464]
    },
    {
        text: '경기 안성시',
        lnglat: [127.2796786, 37.0079695]
    },
    {
        text: '경기 구리시',
        lnglat: [127.1295646, 37.5943124]
    },
    {
        text: '경기 양평군',
        lnglat: [127.4875607, 37.4912195]
    },
    {
        text: '경기 포천시',
        lnglat: [127.2003551, 37.8949148]
    },
    {
        text: '경기 파주시',
        lnglat: [126.7801781, 37.7598688]
    },

    
    

    //부산
    {
        text: '부산 중구',
        lnglat: [129.0323417, 35.1061462]
    },
    {
        text: '부산 금정구',
        lnglat: [129.0922773, 35.2429921]
    },
    {
        text: '부산 북구',
        lnglat: [128.9903711, 35.1971347]
    },
    {
        text: '부산 연제구',
        lnglat: [129.0797244, 35.1761938]
    },
    {
        text: '부산 사상구',
        lnglat: [128.9908173, 35.1526399]
    },
    {
        text: '부산 영도구',
        lnglat: [129.0681448, 35.0912316]
    },
    {
        text: '부산 기장군',
        lnglat: [129.2221542, 35.2445494]
    },
    {
        text: '부산 남구',
        lnglat: [129.084364, 35.1365596]
    },
    {
        text: '부산 사하구',
        lnglat: [128.9747081, 35.1044223]
    },
    {
        text: '부산 부산진구',
        lnglat: [129.0531722, 35.1630009]
    },
    {
        text: '부산 동구',
        lnglat: [129.0569225, 35.1390588]
    },
    {
        text: '부산 서구',
        lnglat: [129.0241207, 35.09773]
    },
    {
        text: '부산 해운대구',
        lnglat: [129.1635509, 35.1631139]
    },
    {
        text: '부산 강서구',
        lnglat: [128.9805666, 35.2122157]
    },
    {
        text: '부산 수영구',
        lnglat: [129.1130831, 35.145615]
    },
    {
        text: '부산 동래구',
        lnglat: [129.0836402, 35.2048575]
    }
    //
];

