
exports.DashboardType = {
    Map: 1,
    Scatter: 2,
    Line: 3
};


/*
* 지도 좌표 변환
* ex [126.98955, 37.5651]
* */
exports.LngLat = [
    //서울
    {
        text: '서울 서초구',
        lnglat: [127.004904, 37.505144]//고속터미널
    },
    {
        text: '서울 강남구',
        lnglat: [127.036957, 37.501040]//역삼역
    },
    {
        text: '서울 종로구',
        lnglat: [126.976436, 37.571874] //광화문역
    },
    {
        text: '서울 송파구',
        lnglat: [127.100134, 37.513457] //잠실역
    },
    {
        text: '서울 동작구',
        lnglat: [126.947710, 37.503336] //상도역
    },
    {
        text: '서울 중구',
        lnglat: [126.993529, 37.561169] //충무로역 37.530196, 126.964807
    },
    {
        text: '서울 용산구',
        lnglat: [126.964807, 37.530196] //용산역
    },
    {
        text: '서울 관악구',
        lnglat: [126.951916, 37.460086] //서울대학교
    },
    {
        text: '서울 양천구',
        lnglat: [126.864290, 37.526293] //목동역
    },
    {
        text: '서울 마포구',
        lnglat: [126.952134, 37.542908] //공덕역
    },
    {
        text: '서울 동대문구',
        lnglat: [127.057872, 37.590066] //회기역
    },
    {
        text: '서울 성동구',
        lnglat: [127.043687, 37.555840] //한양대역
    },

    //경기
    {
        text: '경기 성남시',
        lnglat: [127.108090, 37.366242] //정자역
    },

    //부산
    {
        text: '부산 금정구',
        lnglat: [126.98955, 37.5651]
    }
    //
];

